In [1]:
# Pre-defined lists
names = ['United States', 'Australia', 'Japan', 'India', 'Russia', 'Morocco', 'Egypt']
dr =  [True, False, False, False, True, True, True]
cpc = [809, 731, 588, 18, 200, 70, 45]

In [2]:
my_dict = {
'country':names,
'drives_right':dr,
'cars_per_cap':cpc
}
my_dict

{'country': ['United States',
  'Australia',
  'Japan',
  'India',
  'Russia',
  'Morocco',
  'Egypt'],
 'drives_right': [True, False, False, False, True, True, True],
 'cars_per_cap': [809, 731, 588, 18, 200, 70, 45]}

In [3]:
import pandas as pd

In [4]:
cars =pd.DataFrame(my_dict)
cars

         country  drives_right  cars_per_cap
0  United States          True           809
1      Australia         False           731
2          Japan         False           588
3          India         False            18
4         Russia          True           200
5        Morocco          True            70
6          Egypt          True            45

### Reading CVS File

In [7]:
import pandas as pd

In [10]:
df = pd.read_csv('Mt.Everest Summiters.csv')
df

,_id,NAME,COUNTRY,DAY,MONTH,YEAR,ROUTE,NAME OF THE TEAM,LEADER
0,1,TENZING NORGAY,NEPAL,29,5,1953,SOUTHCOL,BRITISH EXPEDITION,Lord John Hunt
1,2,EDMUND HILLARY,NEW ZEALAND,29,5,1953,SOUTHCOL,BRITISH EXPEDITION,""""
2,3,ERNST SCHMIED,SWITZERLAND,23,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,Alber Eggler
3,4,JUERGE MARMET,SWITZERLAND,23,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,""""
4,5,ADOLF REIST,SWITZERLAND,24,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,""""
...,...,...,...,...,...,...,...,...,...
5296,5297,MR. PEMBA RITA SHERPA,NEPAL,27,5,2017,NaN,"""",""""
5297,5298,MR. PASANG GYALZEN,NEPAL,27,5,2017,NaN,NaN,NaN
5298,5299,MR. MINGMA DORJI SHERPA,NEPAL,16,5,2017,NaN,"""",""""
5299,5300,MR. DAWA SANGE SHERPA,NEPAL,21,5,2017,NaN,"""",""""
5300,5301,MR. PASANG BHOTE,NEPAL,21,5,2017,NaN,"""",""""

In [14]:
df.shape
df.describe()

               _id          DAY        MONTH         YEAR
count  5301.000000  5301.000000  5301.000000  5301.000000
mean   2651.000000    19.540841     5.251651  2007.150915
std    1530.411219     5.384541     1.171380     9.323426
min       1.000000     1.000000     1.000000  1953.000000
25%    1326.000000    17.000000     5.000000  2004.000000
50%    2651.000000    20.000000     5.000000  2009.000000
75%    3976.000000    23.000000     5.000000  2013.000000
max    5301.000000    31.000000    12.000000  2088.000000

### Selecting data

In [23]:
data_dict ={
    'Name' : ['Anish shakya','Manish Shakya','Sanish Shakya'],
    'Age' : [22,21,23],
    'Occupation' :['Data and Business Intelligence analyst','Data Analyst','Data Engineer'],
    'Office' : ['iSend Global','Fintech','iSend'],
    'Location': ['Australia','USA','Japan']
}

In [25]:
df = pd.DataFrame(data_dict)
df

,Name,Age,Occupation,Office,Location
0,Anish shakya,22,Data and Business Intelligence analyst,iSend Global,Australia
1,Manish Shakya,21,Data Analyst,Fintech,USA
2,Sanish Shakya,23,Data Engineer,iSend,Japan

In [27]:
data = pd.read_csv('Mt.Everest Summiters.csv',index_col=0)
data

,NAME,COUNTRY,DAY,MONTH,YEAR,ROUTE,NAME OF THE TEAM,LEADER
_id,,,,,,,,
1,TENZING NORGAY,NEPAL,29,5,1953,SOUTHCOL,BRITISH EXPEDITION,Lord John Hunt
2,EDMUND HILLARY,NEW ZEALAND,29,5,1953,SOUTHCOL,BRITISH EXPEDITION,""""
3,ERNST SCHMIED,SWITZERLAND,23,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,Alber Eggler
4,JUERGE MARMET,SWITZERLAND,23,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,""""
5,ADOLF REIST,SWITZERLAND,24,5,1956,SOUTHCOL,SWITZERLAND EXPEDITION,""""
...,...,...,...,...,...,...,...,...
5297,MR. PEMBA RITA SHERPA,NEPAL,27,5,2017,NaN,"""",""""
5298,MR. PASANG GYALZEN,NEPAL,27,5,2017,NaN,NaN,NaN
5299,MR. MINGMA DORJI SHERPA,NEPAL,16,5,2017,NaN,"""",""""
5300,MR. DAWA SANGE SHERPA,NEPAL,21,5,2017,NaN,"""",""""
5301,MR. PASANG BHOTE,NEPAL,21,5,2017,NaN,"""",""""

## Acessing Data From Dataframe

In [34]:
type(data['NAME'])
type(data[['NAME']])

pandas.core.frame.DataFrame

In [37]:
data[

                         NAME
_id
1              TENZING NORGAY
2              EDMUND HILLARY
3               ERNST SCHMIED
4               JUERGE MARMET
5                 ADOLF REIST
...                       ...
5297    MR. PEMBA RITA SHERPA
5298       MR. PASANG GYALZEN
5299  MR. MINGMA DORJI SHERPA
5300    MR. DAWA SANGE SHERPA
5301         MR. PASANG BHOTE

[5301 rows x 1 columns]

# Loc and iLoc
## Loc 
Loc is based in label names 
## iLoc
iLoc is based on integer or position of the data columns

In [43]:
data.loc[[1]]

,NAME,COUNTRY,DAY,MONTH,YEAR,ROUTE,NAME OF THE TEAM,LEADER
_id,,,,,,,,
1,TENZING NORGAY,NEPAL,29,5,1953,SOUTHCOL,BRITISH EXPEDITION,Lord John Hunt

In [49]:
data.iloc[:,[0,3]]

                         NAME  MONTH
_id
1              TENZING NORGAY      5
2              EDMUND HILLARY      5
3               ERNST SCHMIED      5
4               JUERGE MARMET      5
5                 ADOLF REIST      5
...                       ...    ...
5297    MR. PEMBA RITA SHERPA      5
5298       MR. PASANG GYALZEN      5
5299  MR. MINGMA DORJI SHERPA      5
5300    MR. DAWA SANGE SHERPA      5
5301         MR. PASANG BHOTE      5

[5301 rows x 2 columns]